admbase/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиПродуктовНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ЗакупкиУПоставщиков</registerRecords>
  <registerRecords>InformationRegister.ЦеныПоставщиков</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/AccumulationRegisters/ЗакупкиУПоставщиков/ЗакупкиУПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакупкиУПоставщиков</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

admbase/src/AccumulationRegisters/ОстаткиПродуктовНаСкладах/ОстаткиПродуктовНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродуктовНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

admbase/src/InformationRegisters/ЦеныПоставщиков/ЦеныПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоставщиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/Documents/ПоступлениеТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
#Область ТекстЗапроса
Запрос.Текст = "ВЫБРАТЬ
|	ПоступлениеТоваров.Контрагент КАК Контрагент,
|	ПоступлениеТоваров.МестоХранения КАК МестоХранения,
|	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
|	ПоступлениеТоваровТовары.Количество КАК Количество,
|	ПоступлениеТоваровТовары.Стоимость КАК Стоимость,
|	ПоступлениеТоваров.Дата КАК Период,
|	ПоступлениеТоваровТовары.НомерСтроки КАК НомерСтроки,
|	ПоступлениеТоваровТовары.Цена КАК Цена
|ПОМЕСТИТЬ ПоступившиеТовары
|ИЗ
|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
|		ПО ПоступлениеТоваровТовары.Ссылка = ПоступлениеТоваров.Ссылка
|ГДЕ
|	ПоступлениеТоваровТовары.Ссылка = &Ссылка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПоступившиеТовары.Период КАК Период,
|	ПоступившиеТовары.Контрагент КАК Поставщик,
|	ПоступившиеТовары.Номенклатура КАК Номенклатура,
|	ПоступившиеТовары.Количество КАК Количество,
|	ПоступившиеТовары.Стоимость КАК Стоимость
|ИЗ
|	ПоступившиеТовары КАК ПоступившиеТовары
|
|УПОРЯДОЧИТЬ ПО
|	ПоступившиеТовары.НомерСтроки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПоступившиеТовары.Период КАК Период,
|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
|	ПоступившиеТовары.МестоХранения КАК МестоХранения,
|	ПоступившиеТовары.Номенклатура КАК Номенклатура,
|	ПоступившиеТовары.Количество КАК Количество,
|	ПоступившиеТовары.Стоимость КАК Стоимость
|ИЗ
|	ПоступившиеТовары КАК ПоступившиеТовары
|
|УПОРЯДОЧИТЬ ПО
|	ПоступившиеТовары.НомерСтроки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПоступившиеТовары.Контрагент КАК Контрагент,
|	ПоступившиеТовары.Номенклатура КАК Номенклатура,
|	ПоступившиеТовары.Период КАК Период,
|	ПоступившиеТовары.Цена КАК Цена
|ИЗ
|	ПоступившиеТовары КАК ПоступившиеТовары
|
|УПОРЯДОЧИТЬ ПО
|	ПоступившиеТовары.НомерСтроки";
	
#КонецОбласти

	Результат = Запрос.ВыполнитьПакет();
	
	Движения.ЗакупкиУПоставщиков.Записывать = Истина;
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ЗакупкиУПоставщиков.Добавить(),Выборка)
	КонецЦикла;
	
	
	Движения.ОстаткиПродуктовНаСкладах.Записывать = Истина;
	
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОстаткиПродуктовНаСкладах.Добавить(),Выборка)
	КонецЦикла;
	
	Движения.ЦеныПоставщиков.Записывать = Истина;
	
	Выборка = Результат[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ЦеныПоставщиков.Добавить(),Выборка)
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти	
//СДЕЛАТЬ КОНТРОЛЬ ПРОВЕДЕНИЯ И ОТМЕНЫ ПРОВЕДЕНИЯ
#КонецЕсли
